#Красный, синий и желтый называются основными цветами, потому что их нельзя получить путем смешения других цветов. При смешивании двух основных цветов получается вторичный цвет:

 # если смешать красный и синий, то получится фиолетовый;
 # если смешать красный и желтый, то получится оранжевый;
 # если смешать синий и желтый, то получится зеленый.

# Напишите программу, которая считывает названия двух основных цветов для смешивания.
# Если пользователь вводит что-нибудь помимо названий «красный», «синий» или «желтый»,
# то программа должна вывести сообщение об ошибке. В противном случае программа должна
# вывести название вторичного цвета, который получится в результате.

color_1 = input('введите название цвета: ')
color_2 = input('введите название цвета: ')
a = 'красный'
b = 'синий'
c = 'желтый'

if (color_1 == a or color_1 == b or color_1 == c) and (color_2 == a or color_2 == b or color_2 == c):
    color_1(a) + color_2 (a) = 'красный'
    color_1 (a) + color_2 (b)
    color_1(c) + color_2(c)
    color_1 (b) + color_2(b)
    color_1(b) + color_2(c)


else:
    print('введите другой цвет ')


